# 변수는 상자: 상자 안에는 데이터 값을 저장
# 파이썬에서 = 는 할당 연산자임 
# # 그래서 왼쪽이 변수의 이름이 있음 
# # 오른쪽 값이 왼쪽 변수에  담긴다라고 생각하면 됨 

# # 변수는 박스이고 식별자는 박스에 붙은 이름이며 리터럴은 박스에 담긴 값 = 변수의 이름은 식별자 이고, 변수의 값은 리터럴 이다.
# # 띄어쓰기는 _ 사용하기 

# # 할당 연산자(=)
# # 형태: 변수이름 = 변수의 값 

# name = "박유진" # 문자열
# age = 23 # 숫자 -> 정수형 
# is_male = False #불린형 bool

# print("이름은: ")
# print(name)
# print(type(name))

# print("나이는: ")
# print(age)

# print("남자인가요?: ")
# print(is_male)



# 이름 = '박유진'
# print(이름)
# # 위의 코드들은 사용은 할 수 있는 권장은 하지 않음 (영어가 공용어라...)


# # 변수 이름 짓기 
# name_1 = "박유진" 
# print(name_1)
# # 이런 경우는 안됨 
# 1name


# del name_1 # 변수를 삭제하는 예약어 
# del = '삭제를 의미함' # 라는 변수를 사용할 때는 안됨 


# print_ = '출력을 의미함'
# print (print)




# # 변수는 number라고 하겠음 

# number = 1
# number = 2
# number = 3

# print(number)
# # 상자 안의 가장 마지막에 할당한 값이 나옴 


# x = 10 
# y = 10 
# print(x) # 결과값 10 
# print(y) # 결과값 10 


